/*=============================================================
	■■■ 실행 흐름의 컨트롤(제어문, 조건문과 반복문) ■■■
	- 반복문(for) 실습
	- 별찍기 실습
===============================================================*/

/* ○ 과제
	  
	  다음과 같은 내용이 출력될 수 있도록
	  반복문의 중첩 구문을 작성하여 프로그램을 구현한다.

	실행 예)

		*
	   ***  
      *****
	 *******
	*********
	 *******
	  *****
	   ***
	    *
	
											*/
public class Test059
{
	public static void main(String[] args)
	{
		//트리모양 찍기
		int n=-1;
		int n2=5;
		for (int a=1;a<=5 ;a++ )
		{
			n2 -=1;
			for (int b=1;b<=n2 ;b++ )
			
				System.out.print(" ");
			
			n+=2;
			for (int s1=1;s1<=n ;s1++ )
			{
				System.out.print("*");
			}System.out.println();
		}


		//역트리 찍기
		int n3=9;
		int n4=0;
		for (int a2=1;a2<=4;a2++ )
		{
			n4 +=1;
			for (int b2=1;b2<=n4 ;b2++ )
			{
				System.out.print(" ");
			}
			n3 -=2;
			for (int s2=1;s2<=n3 ;s2++ )
			{
				System.out.print("*");
			}System.out.println();
		}
		
	}
}

//최종결과
/*
    *
   ***
  *****
 *******
*********
 *******
  *****
   ***
    *
계속하려면 아무 키나 누르십시오 . . .
*/
