/*=====================================
	■■■ 연산자(Operator) ■■■
	- 비트 단위 연산자 [>>],[<<],[>>>]
=======================================*/

public class Test023
{
	public static void main(String[] args)
	{
		int x = 128;

		System.out.printf("x << 3 : %d\n", x<<3); //1024
		System.out.printf("x * 8 : %d\n", x*8);   //1024
		// 결과값은 같지만
		// << 가 훨씬 빠르다.

		System.out.printf("x >> 3 : %d\n", x>>3);  //16
		System.out.printf("x / 8 : %d\n", x/8);    //16
		
		// 『>>』는	  비트열 이동 시 빈 자리에 양수 -> 0 / 음수 -> 1 ==> 부호유지
		// 『>>>』는  비트열 이동 시 빈자리 0
		

		System.out.printf("x << 24 : %d\n", x<<24);
		//--==>> x << 24 : -2147483648

		System.out.printf("x << 25 : %d\n", x<<25);
		/* 여기로 나오다가 ← 00000000 00000000 00000000 10000000 ← 여기서 다시 들어옴
														  -------
														 값 안나옴

		  칸을 넘어가면 다시 뒤로 들어온다 하지만 자기 자신값 전은 0 처리 */ 
		//--==>> 0

		System.out.printf("x << 26 : %d\n", x<<26);
		System.out.printf("x << 31 : %d\n", x<<31);
		//--==>> x << 31 : 0 

		System.out.printf("x << 32 : %d\n", x<<32);
		//--==>> x << 32 : 128

	}
}
//최종결과
/*
x << 3 : 1024
x * 8 : 1024
x >> 3 : 16
x / 8 : 16
x << 24 : -2147483648
x << 25 : 0
x << 26 : 0
x << 31 : 0
x << 32 : 128
계속하려면 아무 키나 누르십시오 . . .
*/